test/loadAndStressTests/check.yml
config:
  target: 'https://localhost/'
  tls:
    rejectUnauthorized: false
  phases:
    - duration: 10
      arrivalRate: 20
  defaults:
    headers:
      x-my-service-auth: '987401838271002188298567'
scenarios:
  - flow:
      - post:
          url: "https://login.live.com/oauth20_authorize.srf?client_id=ba13fb4b-878c-4d71-a5eb-f68305542676&scope=openid+profile+offline_access+https%3a%2f%2foutlook.office.com%2fMail.Read&redirect_uri=https%3a%2f%2flocalhost%2fauth%2foutlook%2fcallback&response_type=code&prompt=login&uaid=d50d4a9699fd4872820c05aad815f056&msproxy=1&issuer=mso&tenant=common&ui_locales=en-US&username=shahar0897%40outlook.com"
          formData:
            passwd: "tomer8108"
      - get:
          url: "/Home"